TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_ВремяНахожденияТСНаПЛК/гкс_ВремяНахожденияТСНаПЛК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_ВремяНахожденияТСНаПЛК</name>
  <resources>
    <name>ВремяВзвешенБрутто</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ВремяВзвешенТара</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ЕстьОтклонение</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Отклонение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяНаПЛК</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ДокументРегистрации</name>
    <type>
      <types>DocumentRef.гкс_РегистрацияНаПЛК</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_НастройкиПриемкаПЛКПоТочкамМаршрута/гкс_НастройкиПриемкаПЛКПоТочкамМаршрута.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_НастройкиПриемкаПЛКПоТочкамМаршрута</name>
  <resources>
    <name>ВремяОжидания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтарыйСтатус</name>
    <type>
      <types>EnumRef.гкс_СтатусыЭлектроннойОчереди</types>
    </type>
  </resources>
  <resources>
    <name>НовыйСтатус</name>
    <type>
      <types>EnumRef.гкс_СтатусыЭлектроннойОчереди</types>
    </type>
  </resources>
  <resources>
    <name>ПутьКДокументамСАРА</name>
    <comment>ERP-1605</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИспользуютсяЭлектронныеТабло</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗначениеДопустимогоОтклоненияБрутто</name>
    <comment>ERP-2051</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>АвтоматическоеФормированиеДокументов</name>
    <comment>ERP-2240</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВариантИспользованияТаблоЭлектроннойОчереди</name>
    <type>
      <types>EnumRef.гкс_ВариантыИспользованияТаблоЭлектроннойОчереди</types>
    </type>
  </resources>
  <resources>
    <name>НормативПогрузки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УказыватьПричинуПревышенияНормативаПогрузки</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ТочкаМаршрута</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_ТипыВзвешивания/гкс_ТипыВзвешивания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_ТипыВзвешивания</name>
  <enumValues>
    <name>Въезд</name>
  </enumValues>
  <enumValues>
    <name>Выезд</name>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_ТипРегистрации/гкс_ТипРегистрации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_ТипРегистрации</name>
  <enumValues>
    <name>Приемка</name>
  </enumValues>
  <enumValues>
    <name>Отгрузка</name>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_ТипыТранспортныхСредствДоставки/гкс_ТипыТранспортныхСредствДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_ТипыТранспортныхСредствДоставки</name>
  <enumValues>
    <name>Автомобиль</name>
  </enumValues>
  <enumValues>
    <name>Судно</name>
  </enumValues>
  <enumValues>
    <name>ЖДТранспорт</name>
  </enumValues>
  <enumValues>
    <name>Самолёт</name>
  </enumValues>
  <enumValues>
    <name>БезДоставки</name>
  </enumValues>
  <enumValues>
    <name>Трубопровод</name>
  </enumValues>
  <enumValues>
    <name>Контейнер</name>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_ВремяНахожденияТСНаПЛК/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
    
#Область ПрограммныйИнтерфейс                                     
// Процедура записывает / обновляет запись регистра                                       
// Параметры:
// ДокументРегистрации - ДокументСсылка.гкс_РегистрацияНаПЛК                                              
// ТипВзвешивания - ПеречилениеСсылка.гкс_ТипыВзвешивания                                                 
// ТочкаМаршрута - СправочникСсылка.гкс_ТочкиМаршрута
// МестнаяДата - Дата
 Процедура ДобавитьОбновитьЗапись(ДокументРегистрации, ТипВзвешивания, ТочкаМаршрута, МестнаяДата) Экспорт 
	 
	 УстановитьПривилегированныйРежим(Истина);
	 Набор = СоздатьНаборЗаписей();
	 Набор.Отбор.ДокументРегистрации.Установить(ДокументРегистрации);
	 Набор.Прочитать();
	 Если Набор.Количество() = 0 Тогда
		Запись = Набор.Добавить();
		Запись.ДокументРегистрации = ДокументРегистрации;
	Иначе
		Запись = Набор[0];
	КонецЕсли;                                                            
	
	Если ТипВзвешивания = Перечисления.гкс_ТипыВзвешивания.Въезд Тогда
		Запись.ВремяВзвешенТара = МестнаяДата;
	Иначе
		Запись.ВремяВзвешенБрутто = МестнаяДата;	
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(Запись.ВремяВзвешенБрутто)
		И ЗначениеЗаполнено(Запись.ВремяВзвешенТара) Тогда
		Разность = Запись.ВремяВзвешенБрутто - Запись.ВремяВзвешенТара;
		Минут = Окр(Разность/гкс_ОбщегоНазначенияКлиентСервер.СекундВМинуте(), 0);
		НормативОтгрузки = РегистрыСведений.гкс_НастройкиПриемкаПЛКПоТочкамМаршрута.НормативОтгрузки(ТочкаМаршрута);
		Отклонение = НормативОтгрузки - Минут;
		Если Отклонение<0 Тогда 
			Запись.ЕстьОтклонение = Истина;  // отклонение в большую сторону
		КонецЕсли;	 
		Запись.ВремяНаПЛК = Минут;
		Запись.Отклонение = Отклонение;
		
	КонецЕсли;	 
	Набор.Записать();
	
КонецПроцедуры	    

// Процедура записывает комментарий в регистр
// Параметры:
// Комментарий - Строка
Процедура ОбновитьКомментарийОтклонения(ДокументРегистрации, Комментарий) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина); 
	
	Набор = СоздатьНаборЗаписей();
	Набор.Отбор.ДокументРегистрации.Установить(ДокументРегистрации);    
	Набор.Прочитать();     
	Если Набор.Количество() >0 Тогда
		Запись = Набор[0];
		Запись.Комментарий = Комментарий;
		Набор.Записать();
	КонецЕсли;
	
КонецПроцедуры	   

// Возвращает признак учета времени нахождения ТС на ПЛК
// Параметры:
// ТипРегистрации - ПеречилениеСсылка.гкс_ТипРегистрации                                                 
// ВидПеревозки - ПеречилениеСсылка.гкс_ТипыТранспортныхСредствДоставки                                                 
// ТочкаМаршрута - СправочникСсылка.гкс_ТочкиМаршрута
// Возвращаемое значение:
// - Булево
Функция УчитыватьВремяНахожденияТС(ТипРегистрации, ВидПеревозки, ТочкаМаршрута) Экспорт
	Возврат
		ТипРегистрации = Перечисления.гкс_ТипРегистрации.Отгрузка
		И ВидПеревозки = Перечисления.гкс_ТипыТранспортныхСредствДоставки.Автомобиль 
		И РегистрыСведений.гкс_НастройкиПриемкаПЛКПоТочкамМаршрута.НормативОтгрузки(ТочкаМаршрута) <> 0;
КонецФункции		

// Возвращает данные по времент нахождения на ПЛК по регистрации 
// Параметры:
// ДокументРегистрации - ДокументСсылка.гкс_РегистрацииНаПЛК
// ВозвращаемоеЗначение:
// - Структура
Функция ДанныеПоВремениНахожденияНаПЛК(ДокументРегистрации) Экспорт
	
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("ДокументРегистрации", ДокументРегистрации);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВремяНахожденияТСНаПЛК.ВремяНаПЛК КАК ВремяНаПЛК,
	               |	ВремяНахожденияТСНаПЛК.Комментарий КАК Комментарий
	               |ИЗ
	               |	РегистрСведений.гкс_ВремяНахожденияТСНаПЛК КАК ВремяНахожденияТСНаПЛК
	               |ГДЕ
	               |	ВремяНахожденияТСНаПЛК.ДокументРегистрации = &ДокументРегистрации";
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Данные = Новый Структура("ВремяНаПЛК, Комментарий");
	Иначе	
		ВыгрузкаЗапроса = Результат.Выгрузить()[0];              
		Данные = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ВыгрузкаЗапроса);
	КонецЕсли;	
	Возврат Данные;
КонецФункции	

#КонецОбласти

#КонецЕсли
